NXP/ot-nxp/src/mcxw/platform/radio.c
/*
 *  Copyright (c) 2022-2026, The OpenThread Authors.
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the
 *     names of its contributors may be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file
 *   This file implements the OpenThread platform abstraction for radio communication.
 *
 */
#if (defined(__GNUC__))
#pragma GCC diagnostic ignored "-Wunused-variable"
#endif

#include <openthread-core-config.h>
#include <openthread/config.h>

#include "EmbeddedTypes.h"
#include "FunctionLib.h"
#include "MacInterface.h"
#include "Phy.h"
#include "PhyInterface.h"
#include "fsl_component_messaging.h"
#if defined(HDI_MODE) && (HDI_MODE == 1)
#include "hdi.h"
#endif
#include <assert.h>
#include <stdint.h>
#include <string.h>

#include "openthread-system.h"
#include "utils/code_utils.h"
#include "utils/link_metrics.h"
#include "utils/mac_frame.h"

#include <openthread/platform/alarm-milli.h>
#include <openthread/platform/diag.h>
#include <openthread/platform/radio.h>
#include <openthread/platform/time.h>

#if OPENTHREAD_CONFIG_POLL_ACCELERATOR_ENABLE
#include <openthread/platform/poll_accelerator.h>
#endif

#include "fwk_platform_ot.h"

#ifdef MCXW727C_cm33_core1_SERIES
#include "platform-mcxw72_nbu.h"
#else
#include "low_power.h"
#endif

#if USE_NBU
void PLATFORM_RemoteActiveReq();
void PLATFORM_RemoteActiveRel();
#else /* USE_NBU */
#define PLATFORM_RemoteActiveReq()
#define PLATFORM_RemoteActiveRel()
#endif /* USE_NBU */

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE

#define CMP_OVHD (4 * IEEE802154_SYMBOL_TIME_US) /* 2 LPTRM (32 kHz) ticks */

static bool_t csl_rx = FALSE;

static void set_csl_sample_time();
static void start_csl_receiver();
static void stop_csl_receiver();

#else /* OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE */
#define start_csl_receiver()
#define stop_csl_receiver()
#endif /* OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE */

#define TX_ENCRYPT_DELAY_SYM 200

// clang-format off
#ifndef DEFAULT_CCA_MODE
#define DEFAULT_CCA_MODE                 (gPhyCCAMode1_c)
#endif

#define IEEE802154_FP                    (1 << 4)
#define IEEE802154_ACK_REQUEST           (1 << 5)
#define IEEE802154_MIN_LENGTH            (5)
#define IEEE802154_FRM_CTL_LO_OFFSET     (0)
#define IEEE802154_DSN_OFFSET            (2)
#define IEEE802154_FRM_TYPE_MASK         (0x7)
#define IEEE802154_FRM_TYPE_ACK          (0x2)
#define IEEE802154_SYMBOL_TIME_US        (16)
#define IEEE802154_TURNAROUND_LEN_SYM    (12)
#define IEEE802154_CCA_LEN_SYM           (8)
#define IEEE802154_PHY_SHR_LEN_SYM       (10)
#define IEEE802154_IMM_ACK_WAIT_SYM      (54)
#define IEEE802154_ENH_ACK_WAIT_SYM      (90)

#define PHY_TMR_MAX_VALUE                (gPhyTimeMask_c)
// clang-format on

#ifndef MCXW_RADIO_NUM_OF_RX_BUFS
#if USE_NBU
#define MCXW_RADIO_NUM_OF_RX_BUFS (16) /* max number of RX buffers */
#else
#define MCXW_RADIO_NUM_OF_RX_BUFS (8)
#endif
#endif

#if (MCXW_RADIO_NUM_OF_RX_BUFS) & (MCXW_RADIO_NUM_OF_RX_BUFS - 1)
#error "MCXW_RADIO_NUM_OF_RX_BUFS must be power of 2"
#endif

#define CSL_UNCERT 20 ///< The Uncertainty of the scheduling CSL of transmission by the parent, in ±10 us units.

#define RX_TIME_POLL (((uint32_t)OPENTHREAD_CONFIG_MAC_DATA_POLL_TIMEOUT * 1000) / IEEE802154_SYMBOL_TIME_US)

typedef struct
{
    otRadioFrame RxFrame;
    void        *pPhyBuffer; /* PHY allocated frame. Free it after rx done */
} extendedRadioFrame;

typedef struct
{
    extendedRadioFrame r[MCXW_RADIO_NUM_OF_RX_BUFS];
    volatile uint8_t   head;
    volatile uint8_t   tail;
    volatile uint8_t   next;
    volatile uint8_t   last;
} rxRingBuffer;

static otRadioState sState = OT_RADIO_STATE_DISABLED;
static uint16_t     sPanId;
static uint8_t      sChannel = 0;
static int8_t       sMaxED;
static bool_t       sPromiscuousEnable = FALSE;
static int8_t       sAutoTxPwrLevel    = 0;

/* internal state flags */
static bool_t  rx_on_idle_disabled = FALSE;
static bool_t  is_rx_on_idle       = FALSE;
static bool_t  is_ed_scan          = FALSE;
static bool_t  sTxDone             = FALSE;
static bool_t  sEdScanDone         = FALSE;
static bool_t  is_tx_poll          = FALSE;
static bool_t  is_rx_after_poll    = FALSE;
static bool_t  is_radio_event      = FALSE;
static otError sTxStatus;

static otRadioFrame sTxFrame;
static uint8_t      sTxData[sizeof(macToPdDataMessage_t) + OT_RADIO_FRAME_MAX_SIZE];

static rxRingBuffer sRxRing;     /* Receive Ring Buffer */
static otRadioFrame sRxAckFrame; /* RX Ack Buffers */
static uint8_t      sRxAckData[OT_RADIO_FRAME_MAX_SIZE];

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
static uint32_t sCslPeriod;
static uint32_t sCslSampleTimeUs;
#endif

#if OPENTHREAD_CONFIG_POLL_ACCELERATOR_ENABLE
static bool_t poll_done = FALSE;

static uint8_t        ext_cmd_storage[sizeof(ext_phy_cmd_t) + OT_RADIO_FRAME_MAX_SIZE];
static ext_phy_cmd_t *ext_poll_req = (ext_phy_cmd_t *)(&ext_cmd_storage[0]);

static extendedRadioFrame *ext_rx_frame;
static otRadioFrame       *rx_frame;
static otRadioFrame       *curr_ack;
static otRadioFrame       *prev_ack;
static otRadioFrame        prev_ack_frame;
static uint8_t             prev_ack_data[OT_RADIO_FRAME_MIN_SIZE];

