NXP/ot-nxp/src/mcxw/platform/radio.c
void poll_accell_cb(phyMessageHeader_t *msg, instanceId_t instance_id);
#endif

/* Private functions */
static uint16_t rf_compute_csl_phase(uint32_t aTimeUs);
static void     rf_abort(void);
static void     rf_set_channel(uint8_t channel);
static void     rf_set_tx_power(int8_t tx_power);
static uint64_t rf_adjust_tstamp_from_phy(uint64_t ts);
static uint32_t rf_adjust_tstamp_from_ot(uint32_t time);
static void     rf_set_rx_on_idle(bool_t val);
static void     rf_set_rx_time_poll(uint32_t t);

/* lockless rx ring buffer */
static void                reset_rx_ring();
static void                push_free_frame_rx_ring();
static void                pop_frame_rx_ring();
static extendedRadioFrame *get_frame_rx_ring();
static extendedRadioFrame *get_free_frame_rx_ring();
static bool_t              is_rx_ring_full();

static uint8_t ot_phy_ctx = (uint8_t)(-1);

/* rx ring buffer reset */
static void reset_rx_ring()
{
    sRxRing.head = MCXW_RADIO_NUM_OF_RX_BUFS - 1;
    sRxRing.tail = MCXW_RADIO_NUM_OF_RX_BUFS - 1;
    sRxRing.next = 0;
    sRxRing.last = 0;
}

/* push a newly received frame to the rx ring buffer */
static void push_free_frame_rx_ring()
{
    sRxRing.head = sRxRing.next;
}

/* pop the oldest received frame from the rx ring buffer */
static void pop_frame_rx_ring()
{
    sRxRing.tail = sRxRing.last;
}

/* get the reference to the oldest received frame from the rx ring buffer */
static extendedRadioFrame *get_frame_rx_ring()
{
    extendedRadioFrame *f    = NULL;
    uint8_t             tail = sRxRing.tail;

    if (tail == sRxRing.head)
    {
        /* ring is empty */
        return NULL;
    }

    tail         = (tail + 1) & (MCXW_RADIO_NUM_OF_RX_BUFS - 1);
    f            = &sRxRing.r[tail];
    sRxRing.last = tail;

    return f;
}

/* get the reference to the first free frame from the rx ring buffer */
static extendedRadioFrame *get_free_frame_rx_ring()
{
    extendedRadioFrame *f    = NULL;
    uint8_t             next = (sRxRing.head + 1) & (MCXW_RADIO_NUM_OF_RX_BUFS - 1);

    if (next == sRxRing.tail)
    {
        /* ring is full */
        return NULL;
    }

    f            = &sRxRing.r[next];
    sRxRing.next = next;

    return f;
}

static bool_t is_rx_ring_full()
{
    uint8_t next = (sRxRing.head + 1) & (MCXW_RADIO_NUM_OF_RX_BUFS - 1);

    return (next == sRxRing.tail);
}

otRadioState otPlatRadioGetState(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return sState;
}

void otPlatRadioGetIeeeEui64(otInstance *aInstance, uint8_t *aIeeeEui64)
{
    OT_UNUSED_VARIABLE(aInstance);

    PLATFORM_GetIeee802_15_4Addr(aIeeeEui64);
}

void otPlatRadioSetPanId(otInstance *aInstance, uint16_t aPanId)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibPanId_c;
    msg.msgData.setReq.PibAttributeValue = (uint64_t)aPanId;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

    sPanId = aPanId;
}

void otPlatRadioSetExtendedAddress(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibLongAddress_c;
    msg.msgData.setReq.PibAttributeValue = *(uint64_t *)aExtAddress->m8;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

void otPlatRadioSetShortAddress(otInstance *aInstance, uint16_t aShortAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibShortAddress_c;
    msg.msgData.setReq.PibAttributeValue = (uint64_t)aShortAddress;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

otError otPlatRadioEnable(otInstance *aInstance)
{
    otEXPECT(!otPlatRadioIsEnabled(aInstance));

#if !USE_NBU
    PHY_Enable();
#endif
    /* disable rx on idle */
    otPlatRadioSetRxOnWhenIdle(aInstance, false);

    sState = OT_RADIO_STATE_SLEEP;
    reset_rx_ring();

exit:
    return OT_ERROR_NONE;
}

otError otPlatRadioDisable(otInstance *aInstance)
{
    otEXPECT(otPlatRadioIsEnabled(aInstance));

    /* disable rx on idle */
    otPlatRadioSetRxOnWhenIdle(aInstance, false);
    stop_csl_receiver();

#if !USE_NBU
    PHY_Disable();
#endif
    sState = OT_RADIO_STATE_DISABLED;

exit:
    return OT_ERROR_NONE;
}

bool otPlatRadioIsEnabled(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return sState != OT_RADIO_STATE_DISABLED;
}

otError otPlatRadioSleep(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError status = OT_ERROR_NONE;

    otEXPECT_ACTION(((sState != OT_RADIO_STATE_TRANSMIT) && (sState != OT_RADIO_STATE_DISABLED)),
                    status = OT_ERROR_INVALID_STATE);

    stop_csl_receiver();

    if (is_rx_after_poll)
    {
        is_rx_after_poll = FALSE;
        sState           = OT_RADIO_STATE_SLEEP;
        return status;
    }

    otEXPECT(sState != OT_RADIO_STATE_SLEEP);

    rf_abort();

    sState = OT_RADIO_STATE_SLEEP;

exit:
    return status;
}

void otPlatRadioSetRxOnWhenIdle(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    rx_on_idle_disabled = FALSE;

    if (aEnable)
    {
        is_rx_on_idle = TRUE;
        rf_set_rx_on_idle(TRUE);

        if (sState != OT_RADIO_STATE_TRANSMIT)
        {
            sState = OT_RADIO_STATE_RECEIVE;
        }
        return;
    }

    is_rx_on_idle = FALSE;

    if (!is_ed_scan && (sState != OT_RADIO_STATE_TRANSMIT))
    {
        rf_abort();
        sState = OT_RADIO_STATE_SLEEP;
    }
    else
    {
        rf_set_rx_on_idle(FALSE);
    }
}

otError otPlatRadioReceive(otInstance *aInstance, uint8_t aChannel)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

    otError     status = OT_ERROR_NONE;
    phyStatus_t phy_status;

    otEXPECT_ACTION(((sState != OT_RADIO_STATE_TRANSMIT) && (sState != OT_RADIO_STATE_DISABLED)),
                    status = OT_ERROR_INVALID_STATE);

    /* already in rx on the same channel */
    otEXPECT((sState != OT_RADIO_STATE_RECEIVE) || (sChannel != aChannel));

    sState = OT_RADIO_STATE_RECEIVE;

