NXP/ot-nxp/src/mcxw/platform/radio.c
    rf_set_channel(aChannel);

    msg.msgType                           = gPlmeRxReq_c;
    msg.msgData.setTRxStateReq.state      = gPhySetRxOn_c;
    msg.msgData.setTRxStateReq.rxDuration = 0xFFFFFFFFU;
    msg.msgData.setTRxStateReq.startTime  = gPhySeqStartAsap_c;

    phy_status = MAC_PLME_SapHandler(&msg, ot_phy_ctx);
    if (phy_status != gPhySuccess_c)
    {
        status = OT_ERROR_INVALID_STATE;
    }

exit:
    return status;
}

void otPlatRadioEnableSrcMatch(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

    msg.msgType          = gPlmeSetSAMState_c;
    msg.msgData.SAMState = aEnable;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

otError otPlatRadioAddSrcMatchShortEntry(otInstance *aInstance, const uint16_t aShortAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError            status = OT_ERROR_NONE;
    macToPlmeMessage_t msg;

    msg.msgType                  = gPlmeAddToSapTable_c;
    msg.msgData.deviceAddr.mode  = 2;
    msg.msgData.deviceAddr.panId = sPanId;

    memcpy(msg.msgData.deviceAddr.addr, (uint8_t *)&aShortAddress, 2);

    if (gPhySuccess_c != MAC_PLME_SapHandler(&msg, ot_phy_ctx))
    {
        /* the status is not returned from PHY over RPMSG */
        status = OT_ERROR_NO_BUFS;
    }

    return status;
}

otError otPlatRadioAddSrcMatchExtEntry(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError            status = OT_ERROR_NONE;
    macToPlmeMessage_t msg;

    msg.msgType                  = gPlmeAddToSapTable_c;
    msg.msgData.deviceAddr.mode  = 3;
    msg.msgData.deviceAddr.panId = sPanId;

    /* Received byte order is little endian */
    memcpy(msg.msgData.deviceAddr.addr, (uint8_t *)aExtAddress, 8);

    if (gPhySuccess_c != MAC_PLME_SapHandler(&msg, ot_phy_ctx))
    {
        /* the status is not returned from PHY over RPMSG */
        status = OT_ERROR_NO_BUFS;
    }

    return status;
}

otError otPlatRadioClearSrcMatchShortEntry(otInstance *aInstance, const uint16_t aShortAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError            status = OT_ERROR_NONE;
    macToPlmeMessage_t msg;

    msg.msgType                  = gPlmeRemoveFromSAMTable_c;
    msg.msgData.deviceAddr.mode  = 2;
    msg.msgData.deviceAddr.panId = sPanId;

    memcpy(msg.msgData.deviceAddr.addr, (uint8_t *)&aShortAddress, 2);

    if (gPhySuccess_c != MAC_PLME_SapHandler(&msg, ot_phy_ctx))
    {
        /* the status is not returned from PHY over RPMSG */
        status = OT_ERROR_NO_ADDRESS;
    }

    return status;
}

otError otPlatRadioClearSrcMatchExtEntry(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError            status = OT_ERROR_NONE;
    macToPlmeMessage_t msg;

    msg.msgType                  = gPlmeRemoveFromSAMTable_c;
    msg.msgData.deviceAddr.mode  = 3;
    msg.msgData.deviceAddr.panId = sPanId;

    memcpy(msg.msgData.deviceAddr.addr, (uint8_t *)aExtAddress, 8);

    if (gPhySuccess_c != MAC_PLME_SapHandler(&msg, ot_phy_ctx))
    {
        /* the status is not returned from PHY over RPMSG */
        status = OT_ERROR_NO_ADDRESS;
    }

    return status;
}

void otPlatRadioClearSrcMatchShortEntries(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    /* This must be implemented */
}

void otPlatRadioClearSrcMatchExtEntries(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    /* This must be implemented */
}

otRadioFrame *otPlatRadioGetTransmitBuffer(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return &sTxFrame;
}

static void set_tx_req(pdDataReq_t *tx_req, otRadioFrame *aFrame)
{
    rf_set_channel(aFrame->mChannel);

    tx_req->psduLength  = aFrame->mLength;
    tx_req->CCABeforeTx = DEFAULT_CCA_MODE;

    /* aFrame->mPsdu will point to sTxData data buffer after macToPdDataMessage_t structure */
    tx_req->pPsdu = aFrame->mPsdu;

    if (aFrame->mPsdu[IEEE802154_FRM_CTL_LO_OFFSET] & IEEE802154_ACK_REQUEST)
    {
        tx_req->ackRequired = gPhyRxAckRqd_c;
        /* The 3 bytes are 1 byte frame length and 2 bytes FCS */
        tx_req->txDuration = IEEE802154_CCA_LEN_SYM + IEEE802154_PHY_SHR_LEN_SYM +
                             (3 + aFrame->mLength) * OT_RADIO_SYMBOLS_PER_OCTET + IEEE802154_TURNAROUND_LEN_SYM;

        if (otMacFrameIsVersion2015(aFrame))
        {
            /* Because enhaced ack can be of variable length we need to set the timeout value to
               account for the FCF and addressing fields only, and stop the timeout timer after
               they are received and validated as a valid ACK */
            tx_req->txDuration += IEEE802154_ENH_ACK_WAIT_SYM;
        }
        else
        {
            tx_req->txDuration += IEEE802154_IMM_ACK_WAIT_SYM;
        }
    }
    else
    {
        tx_req->ackRequired = gPhyNoAckRqd_c;
        tx_req->txDuration  = 0xFFFFFFFFU;
    }

    tx_req->flags     = 0;
    tx_req->startTime = gPhySeqStartAsap_c;

    if (aFrame->mInfo.mTxInfo.mTxDelay)
    {
        tx_req->startTime =
            rf_adjust_tstamp_from_ot(aFrame->mInfo.mTxInfo.mTxDelayBaseTime + aFrame->mInfo.mTxInfo.mTxDelay);
        tx_req->startTime /= IEEE802154_SYMBOL_TIME_US;
        tx_req->startTime -= IEEE802154_PHY_SHR_LEN_SYM;
    }

    if (otMacFrameIsSecurityEnabled(aFrame) && otMacFrameIsKeyIdMode1(aFrame))
    {
        if (!aFrame->mInfo.mTxInfo.mIsSecurityProcessed)
        {
            tx_req->flags |= gPhyEncFrame;

            if (!aFrame->mInfo.mTxInfo.mIsHeaderUpdated)
            {
                tx_req->flags |= gPhyUpdHDr;

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
                /* Previously aFrame->mInfo.mTxInfo.mCslPresent was used to determine if the radio code should update
                   the IE header. This field is no longer set by the OT stack. Until the issue is fixed in OT stack
                   check if CSL period is > 0 and always update CSL IE in that case. */
                if (sCslPeriod)
                {
                    uint32_t hdrTimeUs;

                    start_csl_receiver();

                    /* Add TX_ENCRYPT_DELAY_SYM symbols delay to allow encryption to finish */
                    tx_req->startTime = PhyTime_ReadClock() + TX_ENCRYPT_DELAY_SYM;

                    hdrTimeUs = otPlatTimeGet() +
                                (TX_ENCRYPT_DELAY_SYM + IEEE802154_PHY_SHR_LEN_SYM) * IEEE802154_SYMBOL_TIME_US;
                    otMacFrameSetCslIe(aFrame, sCslPeriod, rf_compute_csl_phase(hdrTimeUs));

                    is_tx_poll = FALSE;
                }
#endif
            }
        }
    }
}

otError otPlatRadioTransmit(otInstance *aInstance, otRadioFrame *aFrame)
{
    otError status = OT_ERROR_NONE;
    /* sTxData bufer has reserved memory for both macToPdDataMessage_t and actual data frame after */
    macToPdDataMessage_t *msg = (macToPdDataMessage_t *)sTxData;
    phyStatus_t           phy_status;
    otRadioState          tmp_state;

