NXP/ot-nxp/src/mcxw/platform/radio.c
    otEXPECT_ACTION((sState != OT_RADIO_STATE_DISABLED), status = OT_ERROR_INVALID_STATE);

    is_tx_poll       = otMacFrameIsDataRequest(aFrame);
    is_rx_after_poll = FALSE;

    msg->msgType = gPdDataReq_c;

    set_tx_req(&msg->msgData.dataReq, aFrame);

    tmp_state = sState;
    sState    = OT_RADIO_STATE_TRANSMIT;

    phy_status = MAC_PD_SapHandler(msg, ot_phy_ctx);
    if (phy_status == gPhySuccess_c)
    {
        otPlatRadioTxStarted(aInstance, aFrame);
    }
    else
    {
        sState = tmp_state;
        status = OT_ERROR_INVALID_STATE;
    }
exit:
    return status;
}

int8_t otPlatRadioGetRssi(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    macToPlmeMessage_t msg;

    msg.msgType                          = gPlmeGetReq_c;
    msg.msgData.getReq.PibAttribute      = gPhyGetRSSILevel_c;
    msg.msgData.getReq.PibAttributeValue = 127; /* RSSI is invalid*/

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

    return (int8_t)msg.msgData.getReq.PibAttributeValue;
}

otRadioCaps otPlatRadioGetCaps(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    otRadioCaps caps = OT_RADIO_CAPS_ACK_TIMEOUT | OT_RADIO_CAPS_SLEEP_TO_TX | OT_RADIO_CAPS_ENERGY_SCAN |
                       OT_RADIO_CAPS_RX_ON_WHEN_IDLE;

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    caps |= OT_RADIO_CAPS_TRANSMIT_SEC | OT_RADIO_CAPS_TRANSMIT_TIMING | OT_RADIO_CAPS_RECEIVE_TIMING;
#endif

    return caps;
}

bool otPlatRadioGetPromiscuous(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return sPromiscuousEnable;
}

void otPlatRadioSetPromiscuous(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;
    sPromiscuousEnable = aEnable;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibPromiscuousMode_c;
    msg.msgData.setReq.PibAttributeValue = (uint64_t)aEnable;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

otError otPlatRadioEnergyScan(otInstance *aInstance, uint8_t aScanChannel, uint16_t aScanDuration)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError            status = OT_ERROR_NONE;
    phyStatus_t        phy_status;
    macToPlmeMessage_t msg;

    otEXPECT_ACTION(((sState != OT_RADIO_STATE_TRANSMIT) && (sState != OT_RADIO_STATE_DISABLED)),
                    status = OT_ERROR_INVALID_STATE);

    otEXPECT_ACTION(!is_ed_scan, status = OT_ERROR_BUSY);

    sMaxED = -128;
    rf_set_channel(aScanChannel);

    msg.msgType                          = gPlmeEdReq_c;
    msg.msgData.edReq.startTime          = gPhySeqStartAsap_c;
    msg.msgData.edReq.measureDurationSym = (aScanDuration * 1000) / OT_RADIO_SYMBOL_TIME;

    phy_status = MAC_PLME_SapHandler(&msg, ot_phy_ctx);
    if (phy_status != gPhySuccess_c)
    {
        status = OT_ERROR_INVALID_STATE;
    }
    else
    {
        is_ed_scan = TRUE;
    }
exit:
    return status;
}

otError otPlatRadioGetTransmitPower(otInstance *aInstance, int8_t *aPower)
{
    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(aPower != NULL, error = OT_ERROR_INVALID_ARGS);
    *aPower = sAutoTxPwrLevel;

exit:
    return error;
}

otError otPlatRadioSetTransmitPower(otInstance *aInstance, int8_t aPower)
{
    OT_UNUSED_VARIABLE(aInstance);

    /* Set Power level for TX */
    rf_set_tx_power(aPower);
    sAutoTxPwrLevel = aPower;

    return OT_ERROR_NONE;
}

otError otPlatRadioGetCcaEnergyDetectThreshold(otInstance *aInstance, int8_t *aThreshold)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aThreshold);

    return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatRadioSetCcaEnergyDetectThreshold(otInstance *aInstance, int8_t aThreshold)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aThreshold);

    return OT_ERROR_NOT_IMPLEMENTED;
}

int8_t otPlatRadioGetReceiveSensitivity(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return -102;
}

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
otError otPlatRadioConfigureEnhAckProbing(otInstance          *aInstance,
                                          otLinkMetrics        aLinkMetrics,
                                          const otShortAddress aShortAddress,
                                          const otExtAddress  *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError      error     = OT_ERROR_NONE;
    uint32_t     ieDataLen = 0;
    uint32_t     ieParam   = 0;
    otMacAddress macAddress;
    macAddress.mType                  = OT_MAC_ADDRESS_TYPE_SHORT;
    macAddress.mAddress.mShortAddress = aShortAddress;
    macToPlmeMessage_t msg;

    error = otLinkMetricsConfigureEnhAckProbing(aShortAddress, aExtAddress, aLinkMetrics);
    otEXPECT(error == OT_ERROR_NONE);

    ieDataLen = otLinkMetricsEnhAckGetDataLen(&macAddress);

    if (ieDataLen > 0)
    {
        ieDataLen = otMacFrameGenerateEnhAckProbingIe(msg.msgData.AckIeData.data, NULL, ieDataLen);
    }

    ieParam = (aLinkMetrics.mLqi > 0 ? IeData_Lqi_c : 0) | (aLinkMetrics.mLinkMargin > 0 ? IeData_LinkMargin_c : 0) |
              (aLinkMetrics.mRssi > 0 ? IeData_Rssi_c : 0);

    /* If ieDataLen remains 0 we will delete the IE data */
    msg.msgType                 = gPlmeConfigureAckIeData_c;
    msg.msgData.AckIeData.param = (ieDataLen > 0 ? IeData_MSB_VALID_DATA : 0);
    msg.msgData.AckIeData.param |= ieParam;
    msg.msgData.AckIeData.shortAddr = aShortAddress;
    memcpy(msg.msgData.AckIeData.extAddr, aExtAddress, 8);

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

exit:
    return error;
}
#endif

void otPlatRadioSetMacKey(otInstance             *aInstance,
                          uint8_t                 aKeyIdMode,
                          uint8_t                 aKeyId,
                          const otMacKeyMaterial *aPrevKey,
                          const otMacKeyMaterial *aCurrKey,
                          const otMacKeyMaterial *aNextKey,
                          otRadioKeyType          aKeyType)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aKeyIdMode);

    macToPlmeMessage_t msg;

    assert(OT_KEY_TYPE_LITERAL_KEY == aKeyType || OT_KEY_TYPE_KEY_REF == aKeyType);
    assert(aPrevKey != NULL && aCurrKey != NULL && aNextKey != NULL);

    msg.msgType                  = gPlmeSetMacKey_c;
    msg.msgData.MacKeyData.keyId = aKeyId;

    if (OT_KEY_TYPE_LITERAL_KEY == aKeyType)
    {
        memcpy(msg.msgData.MacKeyData.prevKey, aPrevKey, 16);
        memcpy(msg.msgData.MacKeyData.currKey, aCurrKey, 16);
        memcpy(msg.msgData.MacKeyData.nextKey, aNextKey, 16);
    }

#if (OPENTHREAD_CONFIG_CRYPTO_LIB == OPENTHREAD_CONFIG_CRYPTO_LIB_PSA)
    else if (OT_KEY_TYPE_KEY_REF == aKeyType)
    {
        size_t  keyLength;
        otError status = OT_ERROR_NONE;

        status = otPlatCryptoExportKey(aPrevKey->mKeyMaterial.mKeyRef, msg.msgData.MacKeyData.prevKey, 16, &keyLength);
        if (OT_ERROR_NONE != status || 16 != keyLength)
            return;

        status = otPlatCryptoExportKey(aCurrKey->mKeyMaterial.mKeyRef, msg.msgData.MacKeyData.currKey, 16, &keyLength);
        if (OT_ERROR_NONE != status || 16 != keyLength)
            return;

        status = otPlatCryptoExportKey(aNextKey->mKeyMaterial.mKeyRef, msg.msgData.MacKeyData.nextKey, 16, &keyLength);
        if (OT_ERROR_NONE != status || 16 != keyLength)
            return;
    }
#endif

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

void otPlatRadioSetMacFrameCounter(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

