NXP/ot-nxp/src/mcxw/platform/radio.c
    msg.msgType                 = gPlmeSetMacFrameCounter_c;
    msg.msgData.MacFrameCounter = aMacFrameCounter;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

void otPlatRadioSetMacFrameCounterIfLarger(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    OT_UNUSED_VARIABLE(aInstance);

    macToPlmeMessage_t msg;

    msg.msgType                 = gPlmeSetMacFrameCounterIfLarger_c;
    msg.msgData.MacFrameCounter = aMacFrameCounter;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

uint64_t otPlatRadioGetNow(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return otPlatTimeGet();
}

uint8_t otPlatRadioGetCslAccuracy(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return CONFIG_PLATFORM_CSL_ACCURACY;
}

uint8_t otPlatRadioGetCslUncertainty(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return CSL_UNCERT;
}

otError otPlatRadioReceiveAt(otInstance *aInstance, uint8_t aChannel, uint32_t aStart, uint32_t aDuration)
{
    OT_UNUSED_VARIABLE(aInstance);
    macToPlmeMessage_t msg;
    otError            status = OT_ERROR_NONE;

    otEXPECT_ACTION((sState == OT_RADIO_STATE_SLEEP), status = OT_ERROR_FAILED);

    start_csl_receiver();

    rf_set_channel(aChannel);

    aStart = rf_adjust_tstamp_from_ot(aStart);

    msg.msgType                           = gPlmeRxReq_c;
    msg.msgData.setTRxStateReq.state      = gPhySetRxOn_c;
    msg.msgData.setTRxStateReq.rxDuration = aDuration / IEEE802154_SYMBOL_TIME_US;
    msg.msgData.setTRxStateReq.startTime  = aStart / IEEE802154_SYMBOL_TIME_US;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

exit:
    return status;
}

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
otError otPlatRadioEnableCsl(otInstance         *aInstance,
                             uint32_t            aCslPeriod,
                             otShortAddress      aShortAddr,
                             const otExtAddress *aExtAddr)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aExtAddr);
    OT_UNUSED_VARIABLE(aShortAddr);

    if (aCslPeriod)
    {
        rf_set_rx_time_poll(0);
    }
    else
    {
        rf_set_rx_time_poll(RX_TIME_POLL);
    }

    sCslPeriod = aCslPeriod;

    macToPlmeMessage_t msg;

    msg.msgType           = gPlmeCslEnable_c;
    msg.msgData.cslPeriod = aCslPeriod;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

    return OT_ERROR_NONE;
}

void otPlatRadioUpdateCslSampleTime(otInstance *aInstance, uint32_t aCslSampleTime)
{
    OT_UNUSED_VARIABLE(aInstance);

    sCslSampleTimeUs = aCslSampleTime;
}

static void set_csl_sample_time()
{
    if (!sCslPeriod)
    {
        return;
    }

    macToPlmeMessage_t msg;
    uint32_t           csl_period = sCslPeriod * 10 * IEEE802154_SYMBOL_TIME_US;
    uint32_t           dt         = sCslSampleTimeUs - (uint32_t)otPlatTimeGet();

    /* next channel sample should be in the future */
    while ((dt <= CMP_OVHD) || (dt > (CMP_OVHD + 2 * csl_period)))
    {
        sCslSampleTimeUs += csl_period;
        dt = sCslSampleTimeUs - (uint32_t)otPlatTimeGet();
    }

    /* The CSL sample time is in microseconds and PHY function expects also microseconds */
    msg.msgType               = gPlmeCslSetSampleTime_c;
    msg.msgData.cslSampleTime = rf_adjust_tstamp_from_ot(sCslSampleTimeUs);

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

static void start_csl_receiver()
{
    if (!sCslPeriod)
    {
        return;
    }

    /* NBU has to be awake during CSL receiver trx  so that conversion from
       PHY timebase (NBU) to TMR timebase (host) is valid */
    if (!csl_rx)
    {
        PLATFORM_RemoteActiveReq();

        csl_rx = TRUE;
    }

    /* sample time is converted to PHY time */
    set_csl_sample_time();
}

static void stop_csl_receiver()
{
    if (csl_rx)
    {
        PLATFORM_RemoteActiveRel();

        csl_rx = FALSE;
    }
}
#endif /* OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE */

/*
 * Compute the CSL Phase for the aTimeUs - i.e. the time from the aTimeUs to sCslSampleTimeUs.
 * The assumption is that sCslSampleTimeUs > aTimeUs. Since the time is kept with a limited timer in reality
 * it means that sometimes sCslSampleTimeUs < aTimeUs, when the timer overflows. Therefore the formula should be:
 *
 * if (aTimeUs <= sCslSampleTimeUs)
 *         cslPhaseUs = sCslSampleTimeUs - aTimeUs;
 * else
 *         cslPhaseUs = MAX_TIMER_VALUE - aTimeUs + sCslSampleTimeUs;
 *
 * For simplicity the formula below has been used.
 */
static uint16_t rf_compute_csl_phase(uint32_t aTimeUs)
{
    /* convert CSL Period in microseconds - it was given in 10 symbols */
    uint32_t cslPeriodUs = sCslPeriod * 10 * IEEE802154_SYMBOL_TIME_US;
    uint32_t cslPhaseUs  = (cslPeriodUs - (aTimeUs % cslPeriodUs) + (sCslSampleTimeUs % cslPeriodUs)) % cslPeriodUs;

    return (uint16_t)(cslPhaseUs / (10 * IEEE802154_SYMBOL_TIME_US) + 1);
}
#endif /* OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2 */

/*************************************************************************************************/
static void rf_abort(void)
{
    macToPlmeMessage_t msg;

    msg.msgType                      = gPlmeSetTRxStateReq_c;
    msg.msgData.setTRxStateReq.state = gPhyForceTRxOff_c;

    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

static void rf_set_channel(uint8_t channel)
{
    /* change channel only if it is different */
    if (channel != sChannel)
    {
        macToPlmeMessage_t msg;

        msg.msgType                          = gPlmeSetReq_c;
        msg.msgData.setReq.PibAttribute      = gPhyPibCurrentChannel_c;
        msg.msgData.setReq.PibAttributeValue = (uint64_t)channel;

        (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

        sChannel = channel;
    }
}

static void rf_set_tx_power(int8_t tx_power)
{
    macToPlmeMessage_t msg;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibTransmitPower_c;
    msg.msgData.setReq.PibAttributeValue = (uint64_t)tx_power;

    MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

/* Used to convert from phy clock timestamp (in symbols) to platform time (in us)
   the reception timestamp which must use a true 64bit timestamp source */
static uint64_t rf_adjust_tstamp_from_phy(uint64_t ts)
{
    uint64_t now = PhyTime_ReadClock();
    uint64_t delta;

    delta = (now >= ts) ? (now - ts) : ((PHY_TMR_MAX_VALUE + now) - ts);
    delta *= IEEE802154_SYMBOL_TIME_US;

    return otPlatTimeGet() - delta;
}

static uint32_t rf_adjust_tstamp_from_ot(uint32_t time)
{
    /* The phy timestamp is in symbols so we need to convert it to microseconds */
    uint64_t ts    = PhyTime_ReadClock() * IEEE802154_SYMBOL_TIME_US;
    uint32_t delta = time - (uint32_t)otPlatTimeGet();

