NXP/ot-nxp/src/mcxw/platform/radio.c
    return (uint32_t)(ts + delta);
}

static void convert_ack(otRadioFrame *ack, pdDataCnf_t *cnf)
{
    ack->mChannel            = sChannel;
    ack->mLength             = cnf->ackLength;
    ack->mInfo.mRxInfo.mLqi  = cnf->ppduLinkQuality;
    ack->mInfo.mRxInfo.mRssi = cnf->ppduRssi;
    memcpy(ack->mPsdu, cnf->ackData, ack->mLength);
}

static void convert_rx_frame(otRadioFrame *rx_frm, pdDataInd_t *rx_ind)
{
    /* Retrieve frame information and data */
    rx_frm->mChannel                             = sChannel;
    rx_frm->mInfo.mRxInfo.mLqi                   = rx_ind->ppduLinkQuality;
    rx_frm->mInfo.mRxInfo.mRssi                  = rx_ind->ppduRssi;
    rx_frm->mInfo.mRxInfo.mTimestamp             = rf_adjust_tstamp_from_phy(rx_ind->timeStamp);
    rx_frm->mInfo.mRxInfo.mAckedWithFramePending = rx_ind->rxAckFp;
    rx_frm->mLength                              = rx_ind->psduLength;
    rx_frm->mPsdu                                = rx_ind->pPsdu;
    rx_frm->mInfo.mRxInfo.mAckedWithSecEnhAck    = rx_ind->ackedWithSecEnhAck;

    if (true == rx_ind->ackedWithSecEnhAck)
    {
        rx_frm->mInfo.mRxInfo.mAckFrameCounter = rx_ind->ackFrameCounter;
        rx_frm->mInfo.mRxInfo.mAckKeyId        = rx_ind->ackKeyId;
    }
}

/* Phy Data Service Access Point handler
 * Called by Phy to notify when Tx has been done or Rx data is available */
phyStatus_t PD_OT_MAC_SapHandler(void *pMsg, instanceId_t instance)
{
    pdDataToMacMessage_t *pDataMsg = (pdDataToMacMessage_t *)pMsg;
    extendedRadioFrame   *pRxFrame = NULL;

    assert(pMsg != NULL);

    switch (pDataMsg->msgType)
    {
    case gPdDataInd_c:
        if (is_rx_after_poll &&
            !(pDataMsg->msgData.dataInd.pPsdu[IEEE802154_FRM_CTL_LO_OFFSET] & IEEE802154_ACK_REQUEST))
        {
            /* ignore broadcast packets */
            MSG_Free(pMsg);

            stop_csl_receiver();
            return gPhySuccess_c;
        }

        is_rx_after_poll = FALSE;

        /* RX activity is done */
        pRxFrame = get_free_frame_rx_ring();

        if (pRxFrame)
        {
            convert_rx_frame(&pRxFrame->RxFrame, &pDataMsg->msgData.dataInd);

            // keep Phy Allocated buffer and free it after OT process the packet in otPlatRadioProcess
            // after otPlatRadioReceiveDone is completed
            pRxFrame->pPhyBuffer = (void *)pMsg;

            // Push received frame
            push_free_frame_rx_ring();
        }
        else
        {
            MSG_Free(pMsg);
        }

        if (!rx_on_idle_disabled && is_rx_on_idle && (!pRxFrame || is_rx_ring_full()))
        {
            /* no room to receive more */
            rf_set_rx_on_idle(FALSE);
            rx_on_idle_disabled = TRUE;
        }
        break;

    case gPdDataCnf_c:
    default:
        if (sState == OT_RADIO_STATE_TRANSMIT)
        {
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
            if (otMacFrameIsSecurityEnabled(&sTxFrame) && otMacFrameIsKeyIdMode1(&sTxFrame) &&
                !sTxFrame.mInfo.mTxInfo.mIsSecurityProcessed && !sTxFrame.mInfo.mTxInfo.mIsHeaderUpdated)
            {
                otMacFrameSetFrameCounter(&sTxFrame, pDataMsg->fc);
            }
#endif
            sTxStatus = OT_ERROR_ABORT;

            if (pDataMsg->msgType == gPdDataCnf_c)
            {
                sTxStatus = OT_ERROR_NONE;

                convert_ack(&sRxAckFrame, &pDataMsg->msgData.dataCnf);

                if (is_tx_poll && (sRxAckFrame.mPsdu[IEEE802154_FRM_CTL_LO_OFFSET] & IEEE802154_FP))
                {
                    is_rx_after_poll = TRUE;
                }
            }

            /* TX activity is done */
            sTxDone    = TRUE;
            is_tx_poll = FALSE;
        }
        MSG_Free(pMsg); // for Ack we can free PHY Allocated buffer
        break;
    }

    if (is_ed_scan)
    {
        /* Scan done */
        sEdScanDone = TRUE;
        is_ed_scan  = FALSE;
    }

    if (sTxDone || (sState != OT_RADIO_STATE_TRANSMIT))
    {
        if (is_rx_on_idle || is_rx_after_poll)
        {
            sState = OT_RADIO_STATE_RECEIVE;

            if (sTxDone)
            {
                rf_set_channel(sTxFrame.mInfo.mTxInfo.mRxChannelAfterTxDone);
            }
        }
        else
        {
            sState = OT_RADIO_STATE_SLEEP;
        }
    }

    stop_csl_receiver();

    OSA_InterruptDisable();
    if (!is_radio_event)
    {
        is_radio_event = TRUE;
        PWR_DisallowDeviceToSleep();
    }
    OSA_InterruptEnable();

    otSysEventSignalPending();
    return gPhySuccess_c;
}

/* Phy Layer Management Entities Service Access Point handler
 * Called by Phy to notify PLME event */
phyStatus_t PLME_OT_MAC_SapHandler(void *pMsg, instanceId_t instance)
{
    plmeToMacMessage_t *pPlmeMsg = (plmeToMacMessage_t *)pMsg;

    assert(pMsg != NULL);

    switch (pPlmeMsg->msgType)
    {
    case gPlmeCcaCnf_c:
        if (pPlmeMsg->msgData.ccaCnf.status == gPhyChannelBusy_c)
        {
            /* Channel is busy */
            sTxStatus = OT_ERROR_CHANNEL_ACCESS_FAILURE;
            sTxDone   = TRUE;
        }
        break;

    case gPlmeEdCnf_c:
        sMaxED = pPlmeMsg->msgData.edCnf.maxEnergyLeveldB;

    case gPlmeTimeoutInd_c:
    case gPlmeAbortInd_c:
    default:
        if (OT_RADIO_STATE_TRANSMIT == sState)
        {
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
            if (otMacFrameIsSecurityEnabled(&sTxFrame) && otMacFrameIsKeyIdMode1(&sTxFrame) &&
                !sTxFrame.mInfo.mTxInfo.mIsSecurityProcessed && !sTxFrame.mInfo.mTxInfo.mIsHeaderUpdated)
            {
                otMacFrameSetFrameCounter(&sTxFrame, pPlmeMsg->fc);
            }
#endif
            sTxStatus = OT_ERROR_ABORT;

            if (pPlmeMsg->msgType == gPlmeTimeoutInd_c)
            {
                sTxStatus = OT_ERROR_NO_ACK; /* Ack timeout */
            }
            sTxDone          = TRUE;
            is_tx_poll       = FALSE;
            is_rx_after_poll = FALSE;
        }
        break;
    }

    /* The message has been allocated by the Phy, we have to free it */
    MSG_Free(pMsg);

    if (is_ed_scan)
    {
        /* Scan done */
        sEdScanDone = TRUE;
        is_ed_scan  = FALSE;
    }

    if (is_rx_on_idle)
    {
        sState = OT_RADIO_STATE_RECEIVE;

        if (sTxDone)
        {
            rf_set_channel(sTxFrame.mInfo.mTxInfo.mRxChannelAfterTxDone);
        }
    }
    else
    {
        sState = OT_RADIO_STATE_SLEEP;
    }

    stop_csl_receiver();

    if (sTxDone || sEdScanDone)
    {
        OSA_InterruptDisable();
        if (!is_radio_event)
        {
            is_radio_event = TRUE;
            PWR_DisallowDeviceToSleep();
        }
        OSA_InterruptEnable();

        otSysEventSignalPending();
    }
    return gPhySuccess_c;
}

void otPlatRadioInit(void)
{
    macToPlmeMessage_t msg;

