NXP/ot-nxp/src/mcxw/platform/radio.c
    Phy_Init();

    ot_phy_ctx = PHY_get_ctx();

    /* Register Phy Data Service Access Point (PD_SAP) and Phy Layer Management Entities Service Access Point (PLME_SAP)
     * handlers */
    Phy_RegisterSapHandlers((PD_MAC_SapHandler_t)PD_OT_MAC_SapHandler, (PLME_MAC_SapHandler_t)PLME_OT_MAC_SapHandler,
                            ot_phy_ctx);

    msg.msgType = gPlmeEnableEncryption_c;
    (void)MAC_PLME_SapHandler(&msg, ot_phy_ctx);

    rf_set_rx_time_poll(RX_TIME_POLL);

    sTxFrame.mLength = 0;
    /* Make the mPsdu point to the space after macToPdDataMessage_t in the data buffer. OT will put
       the data packet in this zone when requesting a data transmission */
    sTxFrame.mPsdu = sTxData + sizeof(macToPdDataMessage_t);

    memset(&sRxAckFrame, 0, sizeof(sRxAckFrame));
    sRxAckFrame.mPsdu = sRxAckData;

#if OPENTHREAD_CONFIG_POLL_ACCELERATOR_ENABLE
    PHY_register_ext_cmd_handler(poll_accell_cb, ot_phy_ctx);

    memset(&prev_ack_frame, 0, sizeof(prev_ack_frame));
    prev_ack_frame.mPsdu    = prev_ack_data;
    prev_ack_frame.mPsdu[0] = IEEE802154_FRM_TYPE_ACK;
#endif
}

static void radio_rx_process(otInstance *aInstance)
{
    extendedRadioFrame *f;

#if OPENTHREAD_CONFIG_DIAG_ENABLE
    bool diag_mode = otPlatDiagModeGet();
#endif

    while ((f = get_frame_rx_ring()) != NULL)
    {
#if OPENTHREAD_CONFIG_DIAG_ENABLE
        if (diag_mode)
        {
            otPlatDiagRadioReceiveDone(aInstance, &f->RxFrame, OT_ERROR_NONE);
        }
        else
#endif
        {
            otPlatRadioReceiveDone(aInstance, &f->RxFrame, OT_ERROR_NONE);
        }

        MSG_Free(f->pPhyBuffer); // free PHY Allocated buffer
        f->pPhyBuffer = NULL;

        pop_frame_rx_ring();
    }

    if (rx_on_idle_disabled)
    {
        rf_set_rx_on_idle(TRUE);
        rx_on_idle_disabled = FALSE;
    }
}

void otPlatRadioProcess(otInstance *aInstance)
{
    OSA_InterruptDisable();
    if (is_radio_event)
    {
        is_radio_event = FALSE;
        PWR_AllowDeviceToSleep();
    }
    OSA_InterruptEnable();

    if (sTxDone)
    {
        if (sTxFrame.mPsdu[IEEE802154_FRM_CTL_LO_OFFSET] & IEEE802154_ACK_REQUEST)
        {
            otPlatRadioTxDone(aInstance, &sTxFrame, &sRxAckFrame, sTxStatus);
        }
        else
        {
            otPlatRadioTxDone(aInstance, &sTxFrame, NULL, sTxStatus);
        }

        sTxDone = FALSE;
    }

    radio_rx_process(aInstance);

    if (sEdScanDone)
    {
        otPlatRadioEnergyScanDone(aInstance, sMaxED);
        sEdScanDone = FALSE;
    }

#if OPENTHREAD_CONFIG_POLL_ACCELERATOR_ENABLE
    if (poll_done)
    {
        poll_done = FALSE;
        otPlatPollAcceleratorDone(aInstance, ext_poll_req->count, prev_ack, &sTxFrame, curr_ack, sTxStatus, rx_frame,
                                  OT_ERROR_NONE);

        if (ext_rx_frame)
        {
            MSG_Free(ext_rx_frame->pPhyBuffer);
            ext_rx_frame->pPhyBuffer = NULL;
        }
    }
#endif
}

static void rf_set_rx_on_idle(bool_t val)
{
    macToPlmeMessage_t msg;
    phyStatus_t        phy_status;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibRxOnWhenIdle;
    msg.msgData.setReq.PibAttributeValue = val;

    phy_status = MAC_PLME_SapHandler(&msg, ot_phy_ctx);

    assert(phy_status == gPhySuccess_c);
    OT_UNUSED_VARIABLE(phy_status);
}

static void rf_set_rx_time_poll(uint32_t t)
{
    macToPlmeMessage_t msg;

    msg.msgType                          = gPlmeSetReq_c;
    msg.msgData.setReq.PibAttribute      = gPhyPibRxTimePoll_c;
    msg.msgData.setReq.PibAttributeValue = t;

    MAC_PLME_SapHandler(&msg, ot_phy_ctx);
}

#if OPENTHREAD_CONFIG_POLL_ACCELERATOR_ENABLE
otError otPlatPollAcceleratorStart(otInstance *aInstance, otRadioFrame *aFrame, const otPollAcceleratorConfig *aConfig)
{
    ext_phy_cmd_t *m = ext_poll_req;

    OT_UNUSED_VARIABLE(aInstance);

    m->msgType            = gPhyExtCmd;
    m->cmd                = gMlmePollReq_c;
    m->io.in.min_be       = aConfig->mCsmaMinBe;
    m->io.in.max_be       = aConfig->mCsmaMaxBe;
    m->io.in.max_backoffs = aFrame->mInfo.mTxInfo.mMaxCsmaBackoffs;
    m->io.in.max_retries  = aFrame->mInfo.mTxInfo.mMaxFrameRetries;
    m->io.in.rx_after_tx  = TRUE;
    m->io.in.rx_duration  = (aConfig->mWaitForDataDuration * OT_US_PER_MS) / IEEE802154_SYMBOL_TIME_US;
    m->io.in.period       = aConfig->mPollPeriod;
    m->count              = aConfig->mMaxIterations;
    // m->io.in.min_rssi = aConfig->mRssThreshold;

    set_tx_req(&m->io.in.req, aFrame);

    m->io.in.req.pPsdu = ext_cmd_storage + sizeof(ext_phy_cmd_t);
    memcpy(m->io.in.req.pPsdu, aFrame->mPsdu, aFrame->mLength);

    m->io.in.req.startTime = rf_adjust_tstamp_from_ot(aConfig->mStartTime) / IEEE802154_SYMBOL_TIME_US;

    PHY_ext_cmd((phyMessageHeader_t *)m, ot_phy_ctx);

    return OT_ERROR_NONE;
}

otError otPlatPollAcceleratorStop(otInstance *aInstance)
{
    ext_phy_cmd_t *m = ext_poll_req;

    OT_UNUSED_VARIABLE(aInstance);

    m->msgType = gPhyExtCmd;
    m->cmd     = gMlmeResetReq_c;

    PHY_ext_cmd((phyMessageHeader_t *)m, ot_phy_ctx);

    return OT_ERROR_NONE;
}

void poll_accell_cb(phyMessageHeader_t *msg, instanceId_t instance_id)
{
    ext_phy_cmd_t *m = (ext_phy_cmd_t *)msg;

    OT_UNUSED_VARIABLE(instance_id);

    ext_rx_frame = NULL;
    rx_frame     = NULL;
    curr_ack     = NULL;
    prev_ack     = NULL;
    sTxStatus    = OT_ERROR_ABORT;

    ext_poll_req->count = m->count;
    otEXPECT(m->count);

    switch (m->cmd)
    {
    case gPdDataInd_c:
        ext_rx_frame = get_free_frame_rx_ring();
        if (ext_rx_frame)
        {
            ext_rx_frame->pPhyBuffer = msg;

            rx_frame = &ext_rx_frame->RxFrame;
        }

    case gPdDataCnf_c:
        curr_ack  = &sRxAckFrame;
        sTxStatus = OT_ERROR_NONE;
        break;

    case gPlmeCcaCnf_c:
        sTxStatus = OT_ERROR_CHANNEL_ACCESS_FAILURE;
        break;

    case gPlmeTimeoutInd_c:
        sTxStatus = OT_ERROR_NO_ACK;
        break;

    case gPlmeAbortInd_c:
    default:
        sTxStatus = OT_ERROR_ABORT;
    }

    if (((m->count > 1) || (m->cmd != gPlmeCcaCnf_c)) && otMacFrameIsSecurityEnabled(&sTxFrame) &&
        otMacFrameIsKeyIdMode1(&sTxFrame) && !sTxFrame.mInfo.mTxInfo.mIsSecurityProcessed &&
        !sTxFrame.mInfo.mTxInfo.mIsHeaderUpdated)
    {
        otMacFrameSetFrameCounter(&sTxFrame, m->io.out.fc);
    }

    if (m->count > 1)
    {
        prev_ack                      = &prev_ack_frame;
        prev_ack->mInfo.mRxInfo.mLqi  = m->io.out.cnf.ppduLinkQuality; // m->lqi
        prev_ack->mInfo.mRxInfo.mRssi = m->io.out.cnf.ppduRssi;        // m->rssi
    }

    if (curr_ack)
    {
        convert_ack(curr_ack, &m->io.out.cnf);
    }

    if (rx_frame)
    {
        convert_rx_frame(rx_frame, &m->io.out.rx_ind);
    }

    ext_poll_req->count = m->count - 1;

exit:
    if (!ext_rx_frame)
    {
        MSG_Free(msg);
    }

    poll_done = TRUE;

    OSA_InterruptDisable();
    if (!is_radio_event)
    {
        is_radio_event = TRUE;
        PWR_DisallowDeviceToSleep();
    }
    OSA_InterruptEnable();

    otSysEventSignalPending();
}
#endif
